quickcheck-tests.org
#+auto_tangle: t
* quickcheck-tests
** file organization
:LOGBOOK:
CLOCK: [2025-07-23 Wed 08:38]--[2025-07-23 Wed 08:46] =>  0:08
CLOCK: [2025-07-19 Sat 13:53]--[2025-07-19 Sat 14:02] =>  0:09
:END:
** imports
:LOGBOOK:
CLOCK: [2025-07-25 Fri 06:49]--[2025-07-25 Fri 06:50] =>  0:01
:END:
*** DONE add s to imports 
CLOSED: [2025-07-25 Fri 06:51]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 06:50]--[2025-07-25 Fri 06:51] =>  0:01
:END:
#+begin_src elisp :tangle yes
  ;;; quickcheck.el --- Quickcheck clone       -*- lexical-binding: t; -*-            
          (require 'ert)
          (require 'seq)
          (require 'calc-comb)
          (require 'cl-lib)
          (require 'dash)
          (require 's)

    (let ((parent-directory (file-name-directory (or load-file-name buffer-file-name))))
      (file-name-concat parent-directory "quickcheck"))
    (require 'quickcheck)
#+END_SRC

#+RESULTS:
: quickcheck

** Utilities
*** calc
**** extensions
***** DONE convert-calc-value-into-lisp
#+begin_src elisp :tangle yes
  (ert-deftest-n-times convert-calc-value-into-lisp 100
    (should (floatp (convert-calc-value-into-lisp (math-gaussian-float)))))  		     
#+end_src

*** dash
**** extensions
***** DONE times
#+begin_src elisp :tangle yes
  (ert-deftest times ()    
    (let* ((test-n (random 255))
  	 (test-constant (random))
  	 (actual-result (times (cl-constantly test-constant) test-n))
  	 (actual-constant-count (funcall #'seq-count (apply-partially #'eql test-constant) actual-result)))      
    (should (eql actual-constant-count test-n))))

#+END_SRC

#+RESULTS:
: (1 . 1)

***** DONE times-no-args
#+begin_src elisp :tangle yes

  (ert-deftest-n-times times-no-args 100
    (let* ((test-n (random 255))
  	 (test-constant (random))
  	 (actual-result (times-no-args (lambda () test-constant) test-n))
  	 (actual-constant-count (funcall #'seq-count (apply-partially #'eql test-constant) actual-result)))      
    (should (eql actual-constant-count test-n))))

#+END_SRC

*** seq
**** extensions
***** DONE seq-take-right
CLOSED: [2025-07-21 Mon 20:32]
:PROPERTIES:
:ID:       86ca383c-ed68-4f65-9f22-a5e0517fb7ee
:END:
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:30]--[2025-07-21 Mon 20:32] =>  0:02
CLOCK: [2025-07-21 Mon 19:28]--[2025-07-21 Mon 19:28] =>  0:00
:END:
****** DONE for lists
CLOSED: [2025-07-21 Mon 19:27]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 19:20]--[2025-07-21 Mon 19:27] =>  0:07
CLOCK: [2025-07-19 Sat 13:39]--[2025-07-19 Sat 13:43] =>  0:04
CLOCK: [2025-07-19 Sat 13:17]--[2025-07-19 Sat 13:25] =>  0:08
:END:
- [[id:f6e8c581-96fe-4ed6-9593-342a2f700b31][semigroup-concat-vectors]]
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-take-right-for-lists 100
      (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-list-of-integers)))
  	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-right) test-chunk-length test-list)))
        (should (eql actual-result-length test-chunk-length))
        (should (cl-subsetp actual-result test-list))))  
#+end_src
****** DONE for vectors
CLOSED: [2025-07-21 Mon 19:29]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 19:28]--[2025-07-21 Mon 19:29] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-take-right-for-vectors 100
      (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-vector-of-integers)))
  	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-right) test-chunk-length test-list)))
        (should (eql actual-result-length test-chunk-length))
        (should (vectorp actual-result))))  
#+end_src
****** DONE for strings
CLOSED: [2025-07-21 Mon 19:30]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 19:30]--[2025-07-21 Mon 19:30] =>  0:00
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-take-right-for-strings 100
      (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-string)))
  	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-right) test-chunk-length test-list)))
        (should (eql actual-result-length test-chunk-length))
        (should (stringp actual-result))))  
#+end_src

***** DONE seq-shuffle
CLOSED: [2025-07-23 Wed 05:30]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 02:29]--[2025-07-23 Wed 02:31] =>  0:02
CLOCK: [2025-07-22 Tue 22:31]--[2025-07-22 Tue 22:34] =>  0:03
:END:
- [[id:bc1b1a8d-b455-47e8-891a-a793e9f28034][seq-n-random-values]]
****** DONE list
CLOSED: [2025-07-23 Wed 05:23]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 05:12]--[2025-07-23 Wed 05:12] =>  0:00
CLOCK: [2025-07-23 Wed 02:45]--[2025-07-23 Wed 02:51] =>  0:06
CLOCK: [2025-07-23 Wed 02:36]--[2025-07-23 Wed 02:38] =>  0:02
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-shuffle-list 100
    (-let* (((actual-shuffled-list test-list) (funcall (-compose (-juxt #'seq-shuffle #'identity) #'generate-test-list-of-strings) :min-length 2)))
  	(should-not (seq-difference actual-shuffled-list test-list))))
#+end_src
****** DONE vector
CLOSED: [2025-07-23 Wed 05:27]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 05:26]--[2025-07-23 Wed 05:27] =>  0:01
CLOCK: [2025-07-23 Wed 05:23]--[2025-07-23 Wed 05:25] =>  0:02
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-shuffle-vector 100
    (-let* (((actual-shuffled-vector test-vector) (funcall (-compose (-juxt #'seq-shuffle #'identity) #'generate-test-vector-of-integers))))
          (should (vectorp actual-shuffled-vector))
  	(should-not (seq-difference actual-shuffled-vector test-vector))))
#+end_src
****** DONE string
CLOSED: [2025-07-23 Wed 05:30]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 05:27]--[2025-07-23 Wed 05:29] =>  0:02
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-shuffle-string 100
    (-let* (((actual-shuffled-string test-string) (funcall (-compose (-juxt #'seq-shuffle #'identity) #'generate-test-string))))
          (should (stringp actual-shuffled-string))
  	(should-not (seq-difference actual-shuffled-string test-string))))
#+end_src

***** DONE seq-take-last
CLOSED: [2025-07-23 Wed 08:50]
****** DONE for lists
CLOSED: [2025-07-23 Wed 08:32]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 08:14]--[2025-07-23 Wed 08:32] =>  0:18
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-take-last-for-lists 100
      (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-list-of-integers)))
  	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-last) test-chunk-length test-list)))
        (should (eql actual-result-length test-chunk-length))
        (should (cl-subsetp actual-result test-list))))  
#+end_src
****** DONE for vectors
CLOSED: [2025-07-23 Wed 08:32]
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-take-last-for-vectors 100
      (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-vector-of-integers)))
  	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-last) test-chunk-length test-list)))
        (should (eql actual-result-length test-chunk-length))
        (should (vectorp actual-result))))  
#+end_src
****** DONE for strings
CLOSED: [2025-07-23 Wed 08:32]
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-take-last-for-strings 100
      (-let* (((test-string test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-string)))
  	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-last) test-chunk-length test-string)))
        (should (eql actual-result-length test-chunk-length))
        (should (stringp actual-result))))  
#+end_src

***** DONE seq-random-chunk-length
CLOSED: [2025-07-23 Wed 02:36]
:PROPERTIES:
:ID:       9cd4a40b-7f98-4ea3-b007-91947fae7bec
:END:
:LOGBOOK:
CLOCK: [2025-07-23 Wed 02:31]--[2025-07-23 Wed 02:36] =>  0:05
CLOCK: [2025-07-21 Mon 19:16]--[2025-07-21 Mon 19:20] =>  0:04
CLOCK: [2025-07-21 Mon 18:02]--[2025-07-21 Mon 18:07] =>  0:05
CLOCK: [2025-07-21 Mon 16:39]--[2025-07-21 Mon 16:42] =>  0:03
CLOCK: [2025-07-19 Sat 14:13]--[2025-07-19 Sat 14:26] =>  0:13
:END:
- [[id:86ca383c-ed68-4f65-9f22-a5e0517fb7ee][seq-take-right]]
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-chunk-length 100
      (-let* (((test-chunk-length test-list-length) (funcall (-compose (-juxt #'seq-random-chunk-length #'seq-length) #'generate-test-list-of-integers) :min-length 2)))
        (should (less-than test-chunk-length test-list-length))
        (should (greater-than-or-equal test-chunk-length 1))))

#+end_src
***** DONE seq-n-random-values
CLOSED: [2025-07-24 Thu 00:27]
:PROPERTIES:
:ID:       bc1b1a8d-b455-47e8-891a-a793e9f28034
:END:
- [[id:1b624bbf-bfeb-4ada-8a62-c90ea68fc91b][seq-subsetp]]
****** DONE lists
CLOSED: [2025-07-23 Wed 08:11]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 08:05]--[2025-07-23 Wed 08:11] =>  0:06
CLOCK: [2025-07-23 Wed 07:13]--[2025-07-23 Wed 07:24] =>  0:11
CLOCK: [2025-07-23 Wed 07:00]--[2025-07-23 Wed 07:11] =>  0:11
CLOCK: [2025-07-23 Wed 05:31]--[2025-07-23 Wed 05:37] =>  0:06
CLOCK: [2025-07-22 Tue 22:27]--[2025-07-22 Tue 22:28] =>  0:01
CLOCK: [2025-07-22 Tue 22:24]--[2025-07-22 Tue 22:25] =>  0:01
CLOCK: [2025-07-22 Tue 22:20]--[2025-07-22 Tue 22:23] =>  0:03
CLOCK: [2025-07-22 Tue 22:13]--[2025-07-22 Tue 22:19] =>  0:06
CLOCK: [2025-07-22 Tue 02:31]--[2025-07-22 Tue 02:35] =>  0:04
CLOCK: [2025-07-08 Tue 21:53]--[2025-07-08 Tue 21:57] =>  0:04
CLOCK: [2025-07-08 Tue 19:43]--[2025-07-08 Tue 20:10] =>  0:27
CLOCK: [2025-07-07 Mon 22:27]--[2025-07-07 Mon 22:31] =>  0:04
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-n-random-values-list 100
    (-let* (((test-count test-list) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-list-of-strings) :min-length 2))
  	  (actual-length (funcall (-compose #'seq-length #'seq-n-random-values) test-count test-list)))
      (should (eql actual-length test-count))))
#+end_src

