quickcheck-tests.el
;;; quickcheck.el --- Quickcheck clone       -*- lexical-binding: t; -*-            
        (require 'ert)
        (require 'seq)
        (require 'calc-comb)
        (require 'cl-lib)
        (require 'dash)
        (require 's)

  (let ((parent-directory (file-name-directory (or load-file-name buffer-file-name))))
    (file-name-concat parent-directory "quickcheck"))
  (require 'quickcheck)

(ert-deftest-n-times convert-calc-value-into-lisp 100
  (should (floatp (convert-calc-value-into-lisp (math-gaussian-float)))))

(ert-deftest times ()    
  (let* ((test-n (random 255))
	 (test-constant (random))
	 (actual-result (times (cl-constantly test-constant) test-n))
	 (actual-constant-count (funcall #'seq-count (apply-partially #'eql test-constant) actual-result)))      
  (should (eql actual-constant-count test-n))))

(ert-deftest-n-times times-no-args 100
  (let* ((test-n (random 255))
	 (test-constant (random))
	 (actual-result (times-no-args (lambda () test-constant) test-n))
	 (actual-constant-count (funcall #'seq-count (apply-partially #'eql test-constant) actual-result)))      
  (should (eql actual-constant-count test-n))))

(ert-deftest-n-times seq-take-right-for-lists 100
    (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-list-of-integers)))
	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-right) test-chunk-length test-list)))
      (should (eql actual-result-length test-chunk-length))
      (should (cl-subsetp actual-result test-list))))

(ert-deftest-n-times seq-take-right-for-vectors 100
    (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-vector-of-integers)))
	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-right) test-chunk-length test-list)))
      (should (eql actual-result-length test-chunk-length))
      (should (vectorp actual-result))))

(ert-deftest-n-times seq-take-right-for-strings 100
    (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-string)))
	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-right) test-chunk-length test-list)))
      (should (eql actual-result-length test-chunk-length))
      (should (stringp actual-result))))

(ert-deftest-n-times seq-shuffle-list 100
  (-let* (((actual-shuffled-list test-list) (funcall (-compose (-juxt #'seq-shuffle #'identity) #'generate-test-list-of-strings) :min-length 2)))
	(should-not (seq-difference actual-shuffled-list test-list))))

(ert-deftest-n-times seq-shuffle-vector 100
  (-let* (((actual-shuffled-vector test-vector) (funcall (-compose (-juxt #'seq-shuffle #'identity) #'generate-test-vector-of-integers))))
        (should (vectorp actual-shuffled-vector))
	(should-not (seq-difference actual-shuffled-vector test-vector))))

(ert-deftest-n-times seq-shuffle-string 100
  (-let* (((actual-shuffled-string test-string) (funcall (-compose (-juxt #'seq-shuffle #'identity) #'generate-test-string))))
        (should (stringp actual-shuffled-string))
	(should-not (seq-difference actual-shuffled-string test-string))))

(ert-deftest-n-times seq-take-last-for-lists 100
    (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-list-of-integers)))
	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-last) test-chunk-length test-list)))
      (should (eql actual-result-length test-chunk-length))
      (should (cl-subsetp actual-result test-list))))

(ert-deftest-n-times seq-take-last-for-vectors 100
    (-let* (((test-list test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-vector-of-integers)))
	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-last) test-chunk-length test-list)))
      (should (eql actual-result-length test-chunk-length))
      (should (vectorp actual-result))))

(ert-deftest-n-times seq-take-last-for-strings 100
    (-let* (((test-string test-chunk-length) (funcall (-compose (-juxt #'identity #'seq-random-chunk-length) #'generate-test-string)))
	    ((actual-result actual-result-length) (funcall (-compose #'identity-and-seq-length #'seq-take-last) test-chunk-length test-string)))
      (should (eql actual-result-length test-chunk-length))
      (should (stringp actual-result))))

(ert-deftest-n-times seq-random-chunk-length 100
    (-let* (((test-chunk-length test-list-length) (funcall (-compose (-juxt #'seq-random-chunk-length #'seq-length) #'generate-test-list-of-integers) :min-length 2)))
      (should (less-than test-chunk-length test-list-length))
      (should (greater-than-or-equal test-chunk-length 1))))

(ert-deftest-n-times seq-n-random-values-list 100
  (-let* (((test-count test-list) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-list-of-strings) :min-length 2))
	  (actual-length (funcall (-compose #'seq-length #'seq-n-random-values) test-count test-list)))
    (should (eql actual-length test-count))))
