quickcheck-tests.org
****** DONE vectors
CLOSED: [2025-07-24 Thu 00:22]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 00:18]--[2025-07-24 Thu 00:22] =>  0:04
CLOCK: [2025-07-22 Tue 22:28]--[2025-07-22 Tue 22:31] =>  0:03
CLOCK: [2025-07-22 Tue 22:25]--[2025-07-22 Tue 22:27] =>  0:02
CLOCK: [2025-07-22 Tue 22:23]--[2025-07-22 Tue 22:24] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-n-random-values-vector 100
    (-let* (((test-count test-vector) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-vector-of-integers)))
  	 ((actual-vector actual-length) (funcall (-compose #'identity-and-seq-length #'seq-n-random-values) test-count test-vector)))
      (should (vectorp actual-vector))
      (should (eql actual-length test-count))))      
#+end_src

****** DONE string
CLOSED: [2025-07-24 Thu 00:25]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 00:23]--[2025-07-24 Thu 00:25] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-n-random-values-string 100
    (-let* (((test-count test-string) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-string)))
  	 ((actual-string actual-length) (funcall (-compose #'identity-and-seq-length #'seq-n-random-values) test-count test-string)))
      (should (stringp actual-string))
      (should (eql actual-length test-count))))      
#+end_src

***** DONE seq-random-values
CLOSED: [2025-07-24 Thu 02:46]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 02:29]--[2025-07-24 Thu 02:30] =>  0:01
:END:
- [[id:1b624bbf-bfeb-4ada-8a62-c90ea68fc91b][seq-subsetp]]
****** DONE lists
CLOSED: [2025-07-24 Thu 02:42]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 02:30]--[2025-07-24 Thu 02:40] =>  0:10
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-values-lists 100
    (-let* ((((actual-list actual-list-length) (test-list test-list-length))
  	  (funcall (-compose (apply-partially #'seq-map #'identity-and-seq-length) (-juxt #'seq-random-values #'identity) #'generate-test-list-of-strings))))      
      (should (listp actual-list))
      (should (less-than-or-equal actual-list-length test-list-length))))
#+end_src
****** DONE vectors
CLOSED: [2025-07-24 Thu 02:43]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 02:42]--[2025-07-24 Thu 02:43] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-values-vectors 100
    (-let* ((((actual-vector actual-vector-length) (test-vector test-vector-length))
  	  (funcall (-compose (apply-partially #'seq-map #'identity-and-seq-length) (-juxt #'seq-random-values #'identity) #'generate-test-vector-of-integers))))      
      (should (vectorp actual-vector))
      (should (less-than-or-equal actual-vector-length test-vector-length))))
#+end_src
****** DONE strings
CLOSED: [2025-07-24 Thu 02:46]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 02:44]--[2025-07-24 Thu 02:46] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-values-strings 100
    (-let* ((((actual-string actual-string-length) (test-string test-string-length))
  	  (funcall (-compose (apply-partially #'seq-map #'identity-and-seq-length) (-juxt #'seq-random-values #'identity) #'generate-test-string))))      
      (should (stringp actual-string))
      (should (less-than-or-equal actual-string-length test-string-length))))
#+end_src

***** DONE seq-random-iterate-from-max
CLOSED: [2025-07-24 Thu 07:48]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 07:45]--[2025-07-24 Thu 07:48] =>  0:03
CLOCK: [2025-07-24 Thu 04:37]--[2025-07-24 Thu 04:42] =>  0:05
:END:
- [[id:1b624bbf-bfeb-4ada-8a62-c90ea68fc91b][seq-subsetp]]
****** DONE lists  
CLOSED: [2025-07-24 Thu 07:48]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 04:27]--[2025-07-24 Thu 04:34] =>  0:07
CLOCK: [2025-07-24 Thu 02:47]--[2025-07-24 Thu 02:50] =>  0:03
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-random-iterate-from-max-lists 100
    (-let* (((actual-list test-list-max) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'seq-max) #'generate-test-list-of-floats))))
      (should (seq-every-p (-rpartial #'greater-than-or-equal test-list-max) actual-list))))
#+end_src
****** DONE vectors
CLOSED: [2025-07-24 Thu 07:48]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 04:35]--[2025-07-24 Thu 04:36] =>  0:01
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-random-iterate-from-max-vectors 100
    (-let* (((actual-vector test-vector-max) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'seq-max) #'generate-test-vector-of-integers))))
      (should (vectorp actual-vector))
      (should (seq-every-p (-rpartial #'greater-than-or-equal test-vector-max) actual-vector))))
#+end_src
****** DONE strings
CLOSED: [2025-07-24 Thu 07:48]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 04:36]--[2025-07-24 Thu 04:37] =>  0:01
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-random-iterate-from-max-strings 100
    (-let* (((actual-string test-string-max) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'seq-max) #'generate-test-string))))
      (should (stringp actual-string))
      (should (seq-every-p (-rpartial #'greater-than-or-equal test-string-max) actual-string))))
#+end_src
***** DONE seq-subsetp
CLOSED: [2025-07-25 Fri 08:44]
:PROPERTIES:
:ID:       1b624bbf-bfeb-4ada-8a62-c90ea68fc91b
:END:
:LOGBOOK:
CLOCK: [2025-07-22 Tue 02:28]--[2025-07-22 Tue 02:28] =>  0:00
CLOCK: [2025-07-22 Tue 02:12]--[2025-07-22 Tue 02:27] =>  0:15
:END:
- [[id:138d45c7-6466-4bd3-b053-bba23d776006][seq-random-chunk]]
****** DONE list
CLOSED: [2025-07-24 Thu 07:53]
******* DONE true
CLOSED: [2025-07-24 Thu 07:53]
:PROPERTIES:
:ID:       a9fe509c-4ae7-45a1-bb48-b26b4a10b53a
:END:
:LOGBOOK:
CLOCK: [2025-07-24 Thu 07:48]--[2025-07-24 Thu 07:51] =>  0:03
CLOCK: [2025-07-24 Thu 00:26]--[2025-07-24 Thu 00:28] =>  0:02
CLOCK: [2025-07-24 Thu 00:26]--[2025-07-24 Thu 00:26] =>  0:00
CLOCK: [2025-07-22 Tue 20:26]--[2025-07-22 Tue 20:30] =>  0:04
CLOCK: [2025-07-22 Tue 20:26]--[2025-07-22 Tue 20:26] =>  0:00
CLOCK: [2025-07-22 Tue 02:28]--[2025-07-22 Tue 02:29] =>  0:01
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-subsetp-list-true 100
        (-let* (((test-subset test-list) (funcall (-compose (-juxt #'seq-random-values #'identity) #'generate-test-list-of-strings)))
          (should (seq-subsetp test-subset test-list)))))
  
#+end_src
******* DONE false
CLOSED: [2025-07-24 Thu 07:53]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 07:51]--[2025-07-24 Thu 07:53] =>  0:02
CLOCK: [2025-07-22 Tue 20:33]--[2025-07-22 Tue 20:40] =>  0:07
CLOCK: [2025-07-22 Tue 20:31]--[2025-07-22 Tue 20:33] =>  0:02
CLOCK: [2025-07-22 Tue 02:29]--[2025-07-22 Tue 02:30] =>  0:01
CLOCK: [2025-07-22 Tue 02:27]--[2025-07-22 Tue 02:28] =>  0:01
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-subsetp-list-false 100
        (-let* (((test-subset test-list) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'identity) #'generate-test-list-of-integers)))
          (should-not (seq-subsetp test-subset test-list)))))

#+end_src

****** DONE vector
CLOSED: [2025-07-25 Fri 00:36]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 07:53]--[2025-07-24 Thu 07:54] =>  0:01
:END:
******* DONE true
CLOSED: [2025-07-25 Fri 00:36]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 00:24]--[2025-07-25 Fri 00:30] =>  0:06
CLOCK: [2025-07-25 Fri 00:16]--[2025-07-25 Fri 00:16] =>  0:00
CLOCK: [2025-07-24 Thu 07:54]--[2025-07-24 Thu 07:55] =>  0:01
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-subsetp-vector-true 100
        (-let* (((test-subset test-vector) (funcall (-compose (-juxt #'seq-random-values #'identity) #'generate-test-vector-of-integers))))
          (should (seq-subsetp test-subset test-vector))))

#+end_src
******* DONE false
CLOSED: [2025-07-25 Fri 00:36]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 00:23]--[2025-07-25 Fri 00:24] =>  0:01
CLOCK: [2025-07-24 Thu 07:55]--[2025-07-24 Thu 07:57] =>  0:02
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-subsetp-vector-false 100
        (-let* (((test-subset test-vector) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'identity) #'generate-test-vector-of-integers))))
          (should-not (seq-subsetp test-subset test-vector))))

#+end_src

****** DONE string
CLOSED: [2025-07-25 Fri 08:44]
:PROPERTIES:
:ID:       b5a6e600-7a94-40a4-af4f-5cc6f4496abf
:END:
:LOGBOOK:
CLOCK: [2025-07-25 Fri 01:10]--[2025-07-25 Fri 01:10] =>  0:00
:END:
******* DONE true
CLOSED: [2025-07-25 Fri 08:44]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 08:25]--[2025-07-25 Fri 08:28] =>  0:03
CLOCK: [2025-07-25 Fri 06:51]--[2025-07-25 Fri 06:52] =>  0:01
CLOCK: [2025-07-25 Fri 06:34]--[2025-07-25 Fri 06:35] =>  0:01
CLOCK: [2025-07-25 Fri 04:02]--[2025-07-25 Fri 04:03] =>  0:01
CLOCK: [2025-07-25 Fri 03:59]--[2025-07-25 Fri 04:02] =>  0:03
CLOCK: [2025-07-25 Fri 01:10]--[2025-07-25 Fri 01:12] =>  0:02
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-subsetp-string-true 100
        (-let* (((test-subset test-string) (funcall (-compose (-juxt #'seq-random-chunk #'identity) #'generate-test-string))))
  	(should (seq-subsetp test-subset test-string))))
#+end_src
******* DONE false
CLOSED: [2025-07-25 Fri 08:44]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 08:44]--[2025-07-25 Fri 08:44] =>  0:00
CLOCK: [2025-07-25 Fri 04:03]--[2025-07-25 Fri 04:09] =>  0:06
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times seq-subsetp-string-false 100
        (-let* (((test-subset test-string) (funcall (-compose (-juxt #'reverse #'identity) #'generate-test-string))))
  	(should-not (seq-subsetp test-subset test-string))))
  	
#+end_src

***** DONE seq-random-chunk-of-size-n
CLOSED: [2025-07-25 Fri 06:44]
:PROPERTIES:
:ID:       138d45c7-6466-4bd3-b053-bba23d776006
:END:
:LOGBOOK:
CLOCK: [2025-07-25 Fri 06:41]--[2025-07-25 Fri 06:44] =>  0:03
CLOCK: [2025-07-25 Fri 03:57]--[2025-07-25 Fri 03:58] =>  0:01
CLOCK: [2025-07-21 Mon 22:43]--[2025-07-21 Mon 22:58] =>  0:15
:END:
- [[id:b5a6e600-7a94-40a4-af4f-5cc6f4496abf][string]]
- [[id:b4e905a2-34c5-4837-bb6f-d5b8731f95aa][stimes-string]]
****** DONE string 
CLOSED: [2025-07-25 Fri 06:51]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 06:45]--[2025-07-25 Fri 06:49] =>  0:04
CLOCK: [2025-07-25 Fri 04:02]--[2025-07-25 Fri 04:02] =>  0:00
CLOCK: [2025-07-25 Fri 03:46]--[2025-07-25 Fri 03:55] =>  0:09
CLOCK: [2025-07-25 Fri 01:12]--[2025-07-25 Fri 01:15] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-chunk-of-size-n-string 100
      (-let* (((test-chunk-length test-string) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-string)))
  	    ((actual-chunk actual-chunk-length) (funcall (-compose #'identity-and-seq-length #'seq-random-chunk-of-size-n) test-chunk-length test-string)))
        (should (stringp actual-chunk))
        (should (s-contains? actual-chunk test-string))))
#+end_src

