quickcheck-tests.el

(ert-deftest-n-times seq-n-random-values-vector 100
  (-let* (((test-count test-vector) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-vector-of-integers)))
	 ((actual-vector actual-length) (funcall (-compose #'identity-and-seq-length #'seq-n-random-values) test-count test-vector)))
    (should (vectorp actual-vector))
    (should (eql actual-length test-count))))

(ert-deftest-n-times seq-n-random-values-string 100
  (-let* (((test-count test-string) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-string)))
	 ((actual-string actual-length) (funcall (-compose #'identity-and-seq-length #'seq-n-random-values) test-count test-string)))
    (should (stringp actual-string))
    (should (eql actual-length test-count))))

(ert-deftest-n-times seq-random-values-lists 100
  (-let* ((((actual-list actual-list-length) (test-list test-list-length))
	  (funcall (-compose (apply-partially #'seq-map #'identity-and-seq-length) (-juxt #'seq-random-values #'identity) #'generate-test-list-of-strings))))      
    (should (listp actual-list))
    (should (less-than-or-equal actual-list-length test-list-length))))

(ert-deftest-n-times seq-random-values-vectors 100
  (-let* ((((actual-vector actual-vector-length) (test-vector test-vector-length))
	  (funcall (-compose (apply-partially #'seq-map #'identity-and-seq-length) (-juxt #'seq-random-values #'identity) #'generate-test-vector-of-integers))))      
    (should (vectorp actual-vector))
    (should (less-than-or-equal actual-vector-length test-vector-length))))

(ert-deftest-n-times seq-random-values-strings 100
  (-let* ((((actual-string actual-string-length) (test-string test-string-length))
	  (funcall (-compose (apply-partially #'seq-map #'identity-and-seq-length) (-juxt #'seq-random-values #'identity) #'generate-test-string))))      
    (should (stringp actual-string))
    (should (less-than-or-equal actual-string-length test-string-length))))

(ert-deftest-n-times seq-random-iterate-from-max-lists 100
  (-let* (((actual-list test-list-max) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'seq-max) #'generate-test-list-of-floats))))
    (should (seq-every-p (-rpartial #'greater-than-or-equal test-list-max) actual-list))))

(ert-deftest-n-times seq-random-iterate-from-max-vectors 100
  (-let* (((actual-vector test-vector-max) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'seq-max) #'generate-test-vector-of-integers))))
    (should (vectorp actual-vector))
    (should (seq-every-p (-rpartial #'greater-than-or-equal test-vector-max) actual-vector))))

(ert-deftest-n-times seq-random-iterate-from-max-strings 100
  (-let* (((actual-string test-string-max) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'seq-max) #'generate-test-string))))
    (should (stringp actual-string))
    (should (seq-every-p (-rpartial #'greater-than-or-equal test-string-max) actual-string))))

(ert-deftest-n-times seq-subsetp-list-true 100
      (-let* (((test-subset test-list) (funcall (-compose (-juxt #'seq-random-values #'identity) #'generate-test-list-of-strings)))
        (should (seq-subsetp test-subset test-list)))))

(ert-deftest-n-times seq-subsetp-list-false 100
      (-let* (((test-subset test-list) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'identity) #'generate-test-list-of-integers)))
        (should-not (seq-subsetp test-subset test-list)))))

(ert-deftest-n-times seq-subsetp-vector-true 100
      (-let* (((test-subset test-vector) (funcall (-compose (-juxt #'seq-random-values #'identity) #'generate-test-vector-of-integers))))
        (should (seq-subsetp test-subset test-vector))))

(ert-deftest-n-times seq-subsetp-vector-false 100
      (-let* (((test-subset test-vector) (funcall (-compose (-juxt #'seq-random-iterate-from-max #'identity) #'generate-test-vector-of-integers))))
        (should-not (seq-subsetp test-subset test-vector))))

(ert-deftest-n-times seq-subsetp-string-true 100
      (-let* (((test-subset test-string) (funcall (-compose (-juxt #'seq-random-chunk #'identity) #'generate-test-string))))
	(should (seq-subsetp test-subset test-string))))

(ert-deftest-n-times seq-subsetp-string-false 100
      (-let* (((test-subset test-string) (funcall (-compose (-juxt #'reverse #'identity) #'generate-test-string))))
	(should-not (seq-subsetp test-subset test-string))))

(ert-deftest-n-times seq-random-chunk-of-size-n-string 100
    (-let* (((test-chunk-length test-string) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-string)))
	    ((actual-chunk actual-chunk-length) (funcall (-compose #'identity-and-seq-length #'seq-random-chunk-of-size-n) test-chunk-length test-string)))
      (should (stringp actual-chunk))
      (should (s-contains? actual-chunk test-string))))
