quickcheck-tests.org
****** DONE list 
CLOSED: [2025-07-25 Fri 03:56]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 03:55]--[2025-07-25 Fri 03:55] =>  0:00
CLOCK: [2025-07-25 Fri 01:29]--[2025-07-25 Fri 01:33] =>  0:04
CLOCK: [2025-07-25 Fri 01:23]--[2025-07-25 Fri 01:27] =>  0:04
CLOCK: [2025-07-25 Fri 01:15]--[2025-07-25 Fri 01:18] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-chunk-of-size-n-list 100
      (-let* (((test-chunk-length test-list) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-list-of-integers)))
  	    ((actual-chunk actual-chunk-length) (funcall (-compose #'identity-and-seq-length #'seq-random-chunk-of-size-n) test-chunk-length test-list)))
        (should (listp actual-chunk))
        (should (seq-subsetp actual-chunk test-list))))
#+end_src
****** DONE vector 
CLOSED: [2025-07-25 Fri 03:56]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 03:55]--[2025-07-25 Fri 03:56] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times seq-random-chunk-of-size-n-vector 100
      (-let* (((test-chunk-length test-vector) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-vector-of-integers)))
  	    ((actual-chunk actual-chunk-length) (funcall (-compose #'identity-and-seq-length #'seq-random-chunk-of-size-n) test-chunk-length test-vector)))
        (should (vectorp actual-chunk))
        (should (seq-subsetp actual-chunk test-vector))))
#+end_src


*** math
**** DONE between-one-and-?
CLOSED: [2025-07-21 Mon 18:02]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 17:58]--[2025-07-21 Mon 18:00] =>  0:02
CLOCK: [2025-07-21 Mon 17:49]--[2025-07-21 Mon 17:55] =>  0:06
CLOCK: [2025-07-21 Mon 17:47]--[2025-07-21 Mon 17:49] =>  0:02
CLOCK: [2025-07-21 Mon 16:42]--[2025-07-21 Mon 17:03] =>  0:21
:END:
- [[id:9cd4a40b-7f98-4ea3-b007-91947fae7bec][seq-random-chunk-length]]
***** DONE true test
CLOSED: [2025-07-21 Mon 18:00]
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times between-one-and-?-true 100
    (-let* (((test-? test-integer) (funcall (-compose (-juxt #'1+ #'identity) #'random-integer-in-range-255))))
      (should (eq (funcall (between-one-and-? test-?) test-integer) t))))
#+end_src

***** DONE false test
CLOSED: [2025-07-21 Mon 18:02]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 18:00]--[2025-07-21 Mon 18:02] =>  0:02
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times between-one-and-?-false 100
    (-let* (((test-integer test-?) (funcall (-compose (-juxt #'1+ #'identity) #'random-integer-in-range-255))))
      (should (eq (funcall (between-one-and-? test-?) test-integer) 'nil))))
#+end_src

**** DONE non-zero-bounded-modular-addition
#+begin_src emacs-lisp :tangle yes

      (ert-deftest-n-times non-zero-bounded-modular-addition-max-test 100
        (let* ((range-max (random 100000000))
      	 (range-min (- range-max (random range-max) 2))
      	 (increase 1)
      	 (expected-result range-min)
      	 (current-number (1- range-max))
      	 (actual-result (non-zero-bounded-modular-addition (list range-min range-max) increase current-number)))
  			    (should (eql actual-result expected-result))))


      (ert-deftest-n-times non-zero-bounded-modular-addition-min-test 100
        (let* ((range-max (random 10000000))
    	 (range-min (- range-max (random range-max) 2))
    	 (increase 1)
    	 (expected-result (1+ range-min))
    	 (current-number range-min)
    	 (actual-result (non-zero-bounded-modular-addition (list range-min range-max) increase current-number)))
  			    (should (eql actual-result expected-result))))

    (ert-deftest-n-times non-zero-bounded-modular-addition-basic-integer-test 100
      (let* ((range-max (random 10000000))
    	 (range-min (- range-max (random range-max) 2))
    	 (increase (random range-max))
    	 (current-number (random range-max))
    	 (actual-result (non-zero-bounded-modular-addition (list range-min range-max) increase current-number)))
  			 (should (eql (and (greater-than-or-equal actual-result range-min) (less-than actual-result range-max)) t))))


#+END_SRC

**** DONE random-float-between-0-and-1
#+begin_src elisp :tangle yes
  (ert-deftest-n-times random-float-between-0-and-1 100
    (should (floatp (random-float-between-0-and-1))))  		     
#+END_SRC

**** DONE scale-float-to-range
#+begin_src elisp :tangle yes
  (ert-deftest-n-times scale-float-to-range 100    
      (let* ((test-max (random 10000000))
  	   (test-min (- test-max (random test-max) 2))
  	   (test-float-to-scale (convert-calc-value-into-lisp (math-random-float)))
  	   (actual-float (scale-float-to-range (list test-min test-max) test-float-to-scale)))
        (should (greater-than-or-equal actual-float test-min))
        (should (less-than actual-float test-max))))
#+END_SRC

***** DONE Test divide-array-values-by-max-array-value
CLOSED: [2025-07-05 Sat 08:34]
:LOGBOOK:
CLOCK: [2025-07-04 Fri 03:16]--[2025-07-04 Fri 03:28] =>  0:12
CLOCK: [2025-07-04 Fri 03:13]--[2025-07-04 Fri 03:14] =>  0:01
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times divide-array-values-by-max-array-value 100
    (-let* (((actual-list expected-list-length) (funcall (-juxt #'divide-array-values-by-max-array-value #'seq-length)  (random-integer-list-in-range-255))))
      (should (eql (seq-count-between-zero-and-one actual-list) expected-list-length))))
#+end_src


** Testing 
*** random data generators
**** DONE random-integer-in-range
CLOSED: [2025-06-30 Mon 21:19]
#+begin_src elisp :tangle yes
  (ert-deftest-n-times random-integer-in-range 100    
        (let* ((test-max (random 10000000))
    	   (test-min (- test-max (random test-max) 2))  	   
    	   (actual-integer (random-integer-in-range (list test-min test-max))))
  	(should (integerp actual-integer))
          (should (greater-than-or-equal actual-integer test-min))
          (should (less-than actual-integer test-max))))
#+END_SRC

**** DONE random-integer-list
CLOSED: [2025-07-01 Tue 05:21]
#+BEGIN_SRC emacs-lisp :tangle yes
  (ert-deftest-n-times random-integer-list 100
    (-let* (((actual-list expected-list-length) (funcall (-juxt #'random-integer-list #'identity) (calcFunc-random-255))))
    (should (eql (seq-count-integers actual-list ) expected-list-length))))
#+END_SRC

**** DONE random-integer-range
CLOSED: [2025-07-03 Thu 06:51]
#+BEGIN_SRC emacs-lisp :tangle yes
  (ert-deftest-n-times random-integer-range 100
    (-let* (((actual-range expected-range-length) (funcall (-juxt #'random-integer-range #'identity) (random-integer-in-range (list 1 10000)))))
    (should (eql (range-size actual-range) expected-range-length))))
#+END_SRC
**** DONE divide-by-random-value
CLOSED: [2025-07-07 Mon 19:25]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 19:18]--[2025-07-07 Mon 19:25] =>  0:07
CLOCK: [2025-07-07 Mon 19:16]--[2025-07-07 Mon 19:17] =>  0:01
CLOCK: [2025-07-07 Mon 14:36]--[2025-07-07 Mon 14:56] =>  0:20
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times divide-by-random-value 100
    (-let* (((actual-result actual-input-value) (funcall (-compose (-juxt #'divide-by-random-value #'identity) #'random-integer-in-range-255))))
      (should (floatp actual-result))
      (should (less-than-or-equal actual-result actual-input-value))))
#+end_src
**** DONE divide-array-values-by-random-value
CLOSED: [2025-07-07 Mon 19:27]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 19:25]--[2025-07-07 Mon 19:27] =>  0:02
CLOCK: [2025-07-07 Mon 19:17]--[2025-07-07 Mon 19:17] =>  0:00
CLOCK: [2025-07-07 Mon 14:30]--[2025-07-07 Mon 14:30] =>  0:00
CLOCK: [2025-07-05 Sat 08:35]--[2025-07-05 Sat 08:40] =>  0:05
:END:
#+begin_src emacs-lisp :tangle yes
  (ert-deftest-n-times divide-array-values-by-random-seq-value 100
    (-let* (((actual-list expected-list-length) (funcall (-juxt #'divide-array-values-by-random-value #'seq-length)  (random-integer-list-in-range-255))))
      (should (eql (seq-count-floats actual-list) expected-list-length))))
#+end_src



**** TODO Test generate-test-data
***** DONE Lists
CLOSED: [2025-07-07 Mon 21:56]
****** DONE List of integers
CLOSED: [2025-07-07 Mon 21:44]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 21:38]--[2025-07-07 Mon 21:44] =>  0:06
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-list-of-integers 100
      (-let* (((actual-integer-count actual-list-length actual-list)
  	     (funcall (-compose (-juxt #'seq-count-integers #'seq-length #'identity) #'generate-test-data) :min-length 1 :max-length 255)))
        (should (eql actual-integer-count actual-list-length))
        (should (between-one-and-255 actual-integer-count))))
#+END_SRC
****** DONE List of floats between zero and one
CLOSED: [2025-07-07 Mon 21:47]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 21:44]--[2025-07-07 Mon 21:47] =>  0:03
CLOCK: [2025-07-04 Fri 06:17]--[2025-07-04 Fri 06:24] =>  0:07
CLOCK: [2025-07-04 Fri 03:31]--[2025-07-04 Fri 03:31] =>  0:00
CLOCK: [2025-07-04 Fri 03:28]--[2025-07-04 Fri 03:29] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-list-of-floats-1 100
    (-let* (((actual-floats-count actual-list-length actual-list)
  	     (funcall (-compose (-juxt #'seq-count-floats #'seq-length #'identity) #'generate-test-list-of-floats-between-zero-and-one))))
        (should (eql actual-floats-count actual-list-length))
        (should (between-one-and-255 actual-floats-count))))
#+END_SRC

