quickcheck-tests.el

(ert-deftest-n-times seq-random-chunk-of-size-n-list 100
    (-let* (((test-chunk-length test-list) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-list-of-integers)))
	    ((actual-chunk actual-chunk-length) (funcall (-compose #'identity-and-seq-length #'seq-random-chunk-of-size-n) test-chunk-length test-list)))
      (should (listp actual-chunk))
      (should (seq-subsetp actual-chunk test-list))))

(ert-deftest-n-times seq-random-chunk-of-size-n-vector 100
    (-let* (((test-chunk-length test-vector) (funcall (-compose (-juxt #'seq-random-chunk-length #'identity) #'generate-test-vector-of-integers)))
	    ((actual-chunk actual-chunk-length) (funcall (-compose #'identity-and-seq-length #'seq-random-chunk-of-size-n) test-chunk-length test-vector)))
      (should (vectorp actual-chunk))
      (should (seq-subsetp actual-chunk test-vector))))

(ert-deftest-n-times between-one-and-?-true 100
  (-let* (((test-? test-integer) (funcall (-compose (-juxt #'1+ #'identity) #'random-integer-in-range-255))))
    (should (eq (funcall (between-one-and-? test-?) test-integer) t))))

(ert-deftest-n-times between-one-and-?-false 100
  (-let* (((test-integer test-?) (funcall (-compose (-juxt #'1+ #'identity) #'random-integer-in-range-255))))
    (should (eq (funcall (between-one-and-? test-?) test-integer) 'nil))))

(ert-deftest-n-times non-zero-bounded-modular-addition-max-test 100
    (let* ((range-max (random 100000000))
  	 (range-min (- range-max (random range-max) 2))
  	 (increase 1)
  	 (expected-result range-min)
  	 (current-number (1- range-max))
  	 (actual-result (non-zero-bounded-modular-addition (list range-min range-max) increase current-number)))
			    (should (eql actual-result expected-result))))


  (ert-deftest-n-times non-zero-bounded-modular-addition-min-test 100
    (let* ((range-max (random 10000000))
	 (range-min (- range-max (random range-max) 2))
	 (increase 1)
	 (expected-result (1+ range-min))
	 (current-number range-min)
	 (actual-result (non-zero-bounded-modular-addition (list range-min range-max) increase current-number)))
			    (should (eql actual-result expected-result))))

(ert-deftest-n-times non-zero-bounded-modular-addition-basic-integer-test 100
  (let* ((range-max (random 10000000))
	 (range-min (- range-max (random range-max) 2))
	 (increase (random range-max))
	 (current-number (random range-max))
	 (actual-result (non-zero-bounded-modular-addition (list range-min range-max) increase current-number)))
			 (should (eql (and (greater-than-or-equal actual-result range-min) (less-than actual-result range-max)) t))))

(ert-deftest-n-times random-float-between-0-and-1 100
  (should (floatp (random-float-between-0-and-1))))

(ert-deftest-n-times scale-float-to-range 100    
    (let* ((test-max (random 10000000))
	   (test-min (- test-max (random test-max) 2))
	   (test-float-to-scale (convert-calc-value-into-lisp (math-random-float)))
	   (actual-float (scale-float-to-range (list test-min test-max) test-float-to-scale)))
      (should (greater-than-or-equal actual-float test-min))
      (should (less-than actual-float test-max))))

(ert-deftest-n-times divide-array-values-by-max-array-value 100
  (-let* (((actual-list expected-list-length) (funcall (-juxt #'divide-array-values-by-max-array-value #'seq-length)  (random-integer-list-in-range-255))))
    (should (eql (seq-count-between-zero-and-one actual-list) expected-list-length))))

(ert-deftest-n-times random-integer-in-range 100    
      (let* ((test-max (random 10000000))
  	   (test-min (- test-max (random test-max) 2))  	   
  	   (actual-integer (random-integer-in-range (list test-min test-max))))
	(should (integerp actual-integer))
        (should (greater-than-or-equal actual-integer test-min))
        (should (less-than actual-integer test-max))))

(ert-deftest-n-times random-integer-list 100
  (-let* (((actual-list expected-list-length) (funcall (-juxt #'random-integer-list #'identity) (calcFunc-random-255))))
  (should (eql (seq-count-integers actual-list ) expected-list-length))))

(ert-deftest-n-times random-integer-range 100
  (-let* (((actual-range expected-range-length) (funcall (-juxt #'random-integer-range #'identity) (random-integer-in-range (list 1 10000)))))
  (should (eql (range-size actual-range) expected-range-length))))

(ert-deftest-n-times divide-by-random-value 100
  (-let* (((actual-result actual-input-value) (funcall (-compose (-juxt #'divide-by-random-value #'identity) #'random-integer-in-range-255))))
    (should (floatp actual-result))
    (should (less-than-or-equal actual-result actual-input-value))))

(ert-deftest-n-times divide-array-values-by-random-seq-value 100
  (-let* (((actual-list expected-list-length) (funcall (-juxt #'divide-array-values-by-random-value #'seq-length)  (random-integer-list-in-range-255))))
    (should (eql (seq-count-floats actual-list) expected-list-length))))

(ert-deftest-n-times generate-test-data-for-list-of-integers 100
    (-let* (((actual-integer-count actual-list-length actual-list)
	     (funcall (-compose (-juxt #'seq-count-integers #'seq-length #'identity) #'generate-test-data) :min-length 1 :max-length 255)))
      (should (eql actual-integer-count actual-list-length))
      (should (between-one-and-255 actual-integer-count))))

(ert-deftest-n-times generate-test-data-for-list-of-floats-1 100
  (-let* (((actual-floats-count actual-list-length actual-list)
	     (funcall (-compose (-juxt #'seq-count-floats #'seq-length #'identity) #'generate-test-list-of-floats-between-zero-and-one))))
      (should (eql actual-floats-count actual-list-length))
      (should (between-one-and-255 actual-floats-count))))
