quickcheck-tests.org
****** DONE List of floats 
CLOSED: [2025-07-07 Mon 19:29]
:LOGBOOK:
CLOCK: [2025-07-05 Sat 04:44]--[2025-07-05 Sat 05:02] =>  0:18
CLOCK: [2025-07-04 Fri 04:20]--[2025-07-04 Fri 04:21] =>  0:01
CLOCK: [2025-07-04 Fri 04:17]--[2025-07-04 Fri 04:18] =>  0:01
CLOCK: [2025-07-04 Fri 03:32]--[2025-07-04 Fri 03:39] =>  0:07
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-list-of-floats-2 100
      (-let* (((actual-floats-count test-list-length)
  	     (funcall (-compose (-juxt #'seq-count-floats #'seq-length) #'generate-test-list-of-floats))))
        (should (eql actual-floats-count test-list-length))
        (should (between-one-and-255 actual-floats-count))))
#+END_SRC

****** DONE List of strings
CLOSED: [2025-07-07 Mon 21:52]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 21:47]--[2025-07-07 Mon 21:52] =>  0:05
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-list-of-strings 100
      (-let* (((actual-strings-count test-list-length)
  	     (funcall (-compose (-juxt #'seq-count-strings #'seq-length) #'generate-test-list-of-strings))))
        (should (eql actual-strings-count test-list-length))
        (should (between-one-and-255 actual-strings-count))))
#+END_SRC

***** DONE Single String
CLOSED: [2025-07-07 Mon 21:54]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 21:52]--[2025-07-07 Mon 21:55] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-single-string 100
    (let* ((actual-string (generate-test-string))
  	   (actual-string-length (seq-length actual-string)))
      (should (stringp actual-string))
      (should (between-one-and-255 actual-string-length))))
#+END_SRC

***** WAITING vectors
****** DONE vector of integers
CLOSED: [2025-07-07 Mon 21:59]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 21:59]--[2025-07-07 Mon 21:59] =>  0:00
CLOCK: [2025-07-07 Mon 21:55]--[2025-07-07 Mon 21:58] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-vector-of-integers 100
    (-let* (((actual-integers-count test-vector-length actual-vector)
  	     (funcall (-compose (-juxt #'seq-count-integers #'seq-length #'identity) #'generate-test-vector-of-integers))))
      (should (vectorp actual-vector))
      (should (eql actual-integers-count test-vector-length))
      (should (between-one-and-255 actual-integers-count))))
#+END_SRC
***** alists
****** DONE alist of integers
CLOSED: [2025-07-07 Mon 22:06]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 21:59]--[2025-07-07 Mon 22:06] =>  0:07
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-alist 100
      (-let* (((actual-cons-count actual-alist-length actual-alist) (funcall (-compose (-juxt #'seq-count-cons #'seq-length #'identity) #'generate-test-alist-of-integers))))
        (should (equal actual-cons-count actual-alist-length))
        (should (between-one-and-255 actual-cons-count))))
#+END_SRC

***** con
****** DONE con of integers
CLOSED: [2025-07-08 Tue 22:12]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 22:19]--[2025-07-07 Mon 22:21] =>  0:02
CLOCK: [2025-07-07 Mon 19:29]--[2025-07-07 Mon 19:34] =>  0:05
CLOCK: [2025-07-04 Fri 03:31]--[2025-07-04 Fri 03:32] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-con-0 100
    (-let (((actual-con actual-car actual-cdr)(funcall (-compose (-juxt #'identity #'car #'cdr) #'generate-test-con-of-integers))))
  	 (should (consp actual-con))
  	 (should (integerp actual-car))
  	 (should (integerp actual-cdr))))
#+END_SRC
***** DONE con of floats
CLOSED: [2025-07-08 Tue 23:38]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 22:21]--[2025-07-07 Mon 22:25] =>  0:04
CLOCK: [2025-07-07 Mon 19:34]--[2025-07-07 Mon 19:36] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-con-1 100
    (-let (((actual-con actual-car actual-cdr)(funcall (-compose (-juxt #'identity #'car #'cdr) #'generate-test-con-of-floats))))
  	 (should (consp actual-con))
  	 (should (floatp actual-car))
  	 (should (floatp actual-cdr))))
#+END_SRC

***** DONE con of strings
CLOSED: [2025-07-08 Tue 23:41]
#+begin_src elisp :tangle yes
  (ert-deftest-n-times generate-test-data-for-con-2 100
    (-let (((actual-con actual-car actual-cdr)(funcall (-compose (-juxt #'identity #'car #'cdr) #'generate-test-con-of-strings))))
  	 (should (consp actual-con))
  	 (should (stringp actual-car))
  	 (should (stringp actual-cdr))))
#+end_src


** generics for quickcheck
*** semigroup tests
**** semigroup-concat 
***** DONE string
CLOSED: [2025-07-21 Mon 20:24]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:23]--[2025-07-21 Mon 20:24] =>  0:01
CLOCK: [2025-07-11 Fri 04:26]--[2025-07-11 Fri 04:37] =>  0:11
CLOCK: [2025-07-11 Fri 04:17]--[2025-07-11 Fri 04:25] =>  0:08
CLOCK: [2025-07-08 Tue 23:56]--[2025-07-08 Tue 23:59] =>  0:03
CLOCK: [2025-07-08 Tue 23:52]--[2025-07-08 Tue 23:54] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times semigroup-concat-strings 100
      (-let* ((((test-string-one test-string-two) expected-string-length) (funcall (-compose (-juxt #'identity #'seq-sum-map-length) (apply-partially #'times-no-args #'generate-test-string)) 2))
  	    (((actual-string actual-string-length) result-startswith-string-one result-startswith-string-two)
  	     (funcall (-compose (-juxt #'identity-and-seq-length (apply-partially #'string-prefix-p test-string-one) (apply-partially #'string-suffix-p test-string-two)) #'semigroup-concat) test-string-one test-string-two)))
        (should (and result-startswith-string-one result-startswith-string-two))
        (should (equal actual-string-length expected-string-length))
        (should (stringp actual-string))))
#+end_src
***** DONE list
CLOSED: [2025-07-21 Mon 20:23]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:22]--[2025-07-21 Mon 20:23] =>  0:01
CLOCK: [2025-07-11 Fri 07:56]--[2025-07-11 Fri 07:57] =>  0:01
CLOCK: [2025-07-11 Fri 07:50]--[2025-07-11 Fri 07:50] =>  0:00
CLOCK: [2025-07-11 Fri 06:12]--[2025-07-11 Fri 06:27] =>  0:15
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times semigroup-concat-lists 100
      (-let* ((((test-list-one test-list-two) (test-list-one-length test-list-two-length) expected-list-length) (funcall (-compose (-juxt #'identity #'seq-map-length #'seq-sum-map-length) (apply-partially #'times-no-args #'generate-test-list-of-floats)) 2))
  	    (((actual-list actual-list-length) actual-list-prefix actual-list-suffix)
  	     (funcall (-compose (-juxt #'identity-and-seq-length (apply-partially #'take test-list-one-length) (apply-partially #'-take-last test-list-two-length)) #'semigroup-concat) test-list-one test-list-two)))
        (should (equal actual-list-prefix test-list-one))
        (should (equal actual-list-suffix test-list-two))        
        (should (equal actual-list-length expected-list-length))
        (should (listp actual-list))))
#+end_src
***** DONE vector
CLOSED: [2025-07-21 Mon 20:35]
:PROPERTIES:
:ID:       f6e8c581-96fe-4ed6-9593-342a2f700b31
:END:
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:34]--[2025-07-21 Mon 20:35] =>  0:01
CLOCK: [2025-07-21 Mon 20:24]--[2025-07-21 Mon 20:26] =>  0:02
CLOCK: [2025-07-21 Mon 19:31]--[2025-07-21 Mon 19:37] =>  0:06
CLOCK: [2025-07-11 Fri 07:57]--[2025-07-11 Fri 08:31] =>  0:34
CLOCK: [2025-07-11 Fri 07:55]--[2025-07-11 Fri 07:56] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times semigroup-concat-vectors 100
      (-let* ((((test-vector-one test-vector-two) (test-vector-one-length test-vector-two-length) expected-vector-length) (funcall (-compose (-juxt #'identity #'seq-map-length #'seq-sum-map-length) (apply-partially #'times-no-args #'generate-test-vector-of-integers)) 2))
  	    (((actual-vector actual-vector-length) actual-vector-prefix actual-vector-suffix)
  	     (funcall (-compose (-juxt #'identity-and-seq-length (-rpartial #'seq-take test-vector-one-length) (apply-partially #'seq-take-last test-vector-two-length)) #'semigroup-concat) test-vector-one test-vector-two)))
        (should (equal actual-vector-prefix test-vector-one))
        ;;;(should (equal actual-vector-suffix test-vector-two))        
        (should (equal actual-vector-length expected-vector-length))
        (should (vectorp actual-vector))))
#+end_src
**** stimes
***** TODO string
:PROPERTIES:
:ID:       b4e905a2-34c5-4837-bb6f-d5b8731f95aa
:END:
:LOGBOOK:
CLOCK: [2025-07-21 Mon 22:37]--[2025-07-21 Mon 22:43] =>  0:06
CLOCK: [2025-07-21 Mon 21:32]--[2025-07-21 Mon 21:52] =>  0:20
CLOCK: [2025-07-21 Mon 20:36]--[2025-07-21 Mon 20:41] =>  0:05
:END:
#+begin_src elisp :tangle yes
  (ert-deftest-n-times stimes-string 0
      (-let* ((((test-string test-string-length) test-string-as-list) (funcall (-compose (-juxt #'identity-and-seq-length #'list) #'generate-test-string)))
  	    ((test-times expected-string-length) (funcall (-compose (-juxt #'identity (apply-partially #'*)) #'random-integer-in-range-255)))
  	    ((actual-result actual-result-as-list) (funcall (-compose (-juxt #'identity (-compose )) #'stimes) test-times test-string)))
      (should (stringp actual-result))
      (should (eql test-string-as-list))))
#+end_src
***** TODO list
***** TODO vector
*** functor tests
**** Functor laws
- [Identity]    @'fmap' 'id' == 'id'@
- [Composition] @'fmap' (f . g) == 'fmap' f . 'fmap' g@
**** fmap 
***** fmap for lists
#+begin_src elisp :tangle yes
  (ert-deftest-n-times fmap-for-list 0
    (let* ((test-list (generate-test-data))
  	 (test-list-length (seq-length test-list))
  	 (actual-list (fmap #'1+ test-list)))
      (should (listp actual-list))
      (should (eql (-sum actual-list) (+ (-sum test-list) test-list-length)))))

#+END_SRC
