quickcheck-tests.el

(ert-deftest-n-times generate-test-data-for-list-of-floats-2 100
    (-let* (((actual-floats-count test-list-length)
	     (funcall (-compose (-juxt #'seq-count-floats #'seq-length) #'generate-test-list-of-floats))))
      (should (eql actual-floats-count test-list-length))
      (should (between-one-and-255 actual-floats-count))))

(ert-deftest-n-times generate-test-data-for-list-of-strings 100
    (-let* (((actual-strings-count test-list-length)
	     (funcall (-compose (-juxt #'seq-count-strings #'seq-length) #'generate-test-list-of-strings))))
      (should (eql actual-strings-count test-list-length))
      (should (between-one-and-255 actual-strings-count))))

(ert-deftest-n-times generate-test-data-for-single-string 100
  (let* ((actual-string (generate-test-string))
	   (actual-string-length (seq-length actual-string)))
    (should (stringp actual-string))
    (should (between-one-and-255 actual-string-length))))

(ert-deftest-n-times generate-test-data-for-vector-of-integers 100
  (-let* (((actual-integers-count test-vector-length actual-vector)
	     (funcall (-compose (-juxt #'seq-count-integers #'seq-length #'identity) #'generate-test-vector-of-integers))))
    (should (vectorp actual-vector))
    (should (eql actual-integers-count test-vector-length))
    (should (between-one-and-255 actual-integers-count))))

(ert-deftest-n-times generate-test-data-for-alist 100
    (-let* (((actual-cons-count actual-alist-length actual-alist) (funcall (-compose (-juxt #'seq-count-cons #'seq-length #'identity) #'generate-test-alist-of-integers))))
      (should (equal actual-cons-count actual-alist-length))
      (should (between-one-and-255 actual-cons-count))))

(ert-deftest-n-times generate-test-data-for-con-0 100
  (-let (((actual-con actual-car actual-cdr)(funcall (-compose (-juxt #'identity #'car #'cdr) #'generate-test-con-of-integers))))
	 (should (consp actual-con))
	 (should (integerp actual-car))
	 (should (integerp actual-cdr))))

(ert-deftest-n-times generate-test-data-for-con-1 100
  (-let (((actual-con actual-car actual-cdr)(funcall (-compose (-juxt #'identity #'car #'cdr) #'generate-test-con-of-floats))))
	 (should (consp actual-con))
	 (should (floatp actual-car))
	 (should (floatp actual-cdr))))

(ert-deftest-n-times generate-test-data-for-con-2 100
  (-let (((actual-con actual-car actual-cdr)(funcall (-compose (-juxt #'identity #'car #'cdr) #'generate-test-con-of-strings))))
	 (should (consp actual-con))
	 (should (stringp actual-car))
	 (should (stringp actual-cdr))))

(ert-deftest-n-times semigroup-concat-strings 100
    (-let* ((((test-string-one test-string-two) expected-string-length) (funcall (-compose (-juxt #'identity #'seq-sum-map-length) (apply-partially #'times-no-args #'generate-test-string)) 2))
	    (((actual-string actual-string-length) result-startswith-string-one result-startswith-string-two)
	     (funcall (-compose (-juxt #'identity-and-seq-length (apply-partially #'string-prefix-p test-string-one) (apply-partially #'string-suffix-p test-string-two)) #'semigroup-concat) test-string-one test-string-two)))
      (should (and result-startswith-string-one result-startswith-string-two))
      (should (equal actual-string-length expected-string-length))
      (should (stringp actual-string))))

(ert-deftest-n-times semigroup-concat-lists 100
    (-let* ((((test-list-one test-list-two) (test-list-one-length test-list-two-length) expected-list-length) (funcall (-compose (-juxt #'identity #'seq-map-length #'seq-sum-map-length) (apply-partially #'times-no-args #'generate-test-list-of-floats)) 2))
	    (((actual-list actual-list-length) actual-list-prefix actual-list-suffix)
	     (funcall (-compose (-juxt #'identity-and-seq-length (apply-partially #'take test-list-one-length) (apply-partially #'-take-last test-list-two-length)) #'semigroup-concat) test-list-one test-list-two)))
      (should (equal actual-list-prefix test-list-one))
      (should (equal actual-list-suffix test-list-two))        
      (should (equal actual-list-length expected-list-length))
      (should (listp actual-list))))

(ert-deftest-n-times semigroup-concat-vectors 100
    (-let* ((((test-vector-one test-vector-two) (test-vector-one-length test-vector-two-length) expected-vector-length) (funcall (-compose (-juxt #'identity #'seq-map-length #'seq-sum-map-length) (apply-partially #'times-no-args #'generate-test-vector-of-integers)) 2))
	    (((actual-vector actual-vector-length) actual-vector-prefix actual-vector-suffix)
	     (funcall (-compose (-juxt #'identity-and-seq-length (-rpartial #'seq-take test-vector-one-length) (apply-partially #'seq-take-last test-vector-two-length)) #'semigroup-concat) test-vector-one test-vector-two)))
      (should (equal actual-vector-prefix test-vector-one))
      ;;;(should (equal actual-vector-suffix test-vector-two))        
      (should (equal actual-vector-length expected-vector-length))
      (should (vectorp actual-vector))))

(ert-deftest-n-times stimes-string 0
    (-let* ((((test-string test-string-length) test-string-as-list) (funcall (-compose (-juxt #'identity-and-seq-length #'list) #'generate-test-string)))
	    ((test-times expected-string-length) (funcall (-compose (-juxt #'identity (apply-partially #'*)) #'random-integer-in-range-255)))
	    ((actual-result actual-result-as-list) (funcall (-compose (-juxt #'identity (-compose )) #'stimes) test-times test-string)))
    (should (stringp actual-result))
    (should (eql test-string-as-list))))

(ert-deftest-n-times fmap-for-list 0
  (let* ((test-list (generate-test-data))
	 (test-list-length (seq-length test-list))
	 (actual-list (fmap #'1+ test-list)))
    (should (listp actual-list))
    (should (eql (-sum actual-list) (+ (-sum test-list) test-list-length)))))
