quickcheck-tests.org
***** fmap for vectors
#+begin_src elisp :tangle yes
  (ert-deftest-n-times fmap-for-vectors 0
    (let* ((test-vector (generate-test-vector-of-integers))
  	 (test-vector-length (seq-length test-vector))
  	 (actual-vector (fmap #'1+ test-vector)))
      (should (vectorp actual-vector))
      (should (eql (-sum actual-vector) (+ (-sum test-vector) test-vector-length)))))

#+END_SRC
**** <$
***** <$ for list
#+begin_src elisp :tangle yes
  (ert-deftest-n-times fmap-constantly-for-list 0
    (let* ((test-list (generate-test-data))
  	 (expected-list-length (seq-length test-list))
  	 (test-constant (math-random-base))
  	 (actual-list (<$ test-constant test-list)))
      (should (listp actual-list))
      (should (eql expected-list-length expected-list-length))))

#+END_SRC
***** <$ for vector
#+begin_src elisp :tangle yes
  (ert-deftest-n-times fmap-constantly-for-vector 0
    (let* ((test-vector (generate-test-vector-of-integers))
  	 (expected-vector-length (seq-length test-vector))
  	 (test-constant (math-random-base))
  	 (actual-vector (<$ test-constant test-vector)))
       (should (vectorp actual-vector))
      (should (eql (seq-count (apply-partially eql test-constant)) expected-list-length))))

#+END_SRC
***** <$ for a string
#+begin_src elisp :tangle yes
  (ert-deftest-n-times fmap-constantly-for-string 0
    (let* ((test-string (generate-test-string-of-integers))
  	 (expected-string-length (seq-length test-string))
  	 (test-constant (math-random-base))
  	 (actual-string (<$ test-constant test-string)))
       (should (stringp actual-string))
      (should (eql (seq-count (apply-partially eql test-constant)) expected-list-length))))

#+END_SRC




